example of a parameterless function
```scala
> implicit def toDegree( d:Double ) = new {

	def � = d*2 // parameterless method
}
toDegree: (d: Double)java.lang.Object{def �: Double}

> 3�
res0: Double = 6.0 // ok

> 3 + 3�
res1: Double = 12.0  // should be 9.0

> 3� + 3
<console>:6: error: toDegree(3.0).� of type Double does not take parameters
       3� + 3
        ^
```

example of an empty-paren function
```scala
> implicit def toDegree( d:Double ) = new {

	def �() = d*2 // empty-paren method
}
toDegree: (d: Double)java.lang.Object{def �(): Double}

> 3�
res3: Double = 6.0 // ok

> 3�()
res4: Double = 6.0 // ok

> 3 + 3� 
res5: Double = 12.0 // should be 9.0

> 3� + 3
<console>:8: error: too many arguments for method �: ()Double
       3� + 3
        ^
> 3 + 3�()
res6: Double = 9.0  // ok

> 3�() + 3�()
res7: Double = 12.0 // ok

> 3�() + 3�
res8: Double = 18.0 // should be 12.0
```

