example of a parameterless function

```scala
> implicit def toDegree( d:Double ) = new {

	def � = d*2 // parameterless method
}
toDegree: (d: Double)java.lang.Object{def �: Double}

> 3�
res0: Double = 6.0 // ok

> 3 + 3�
res1: Double = 12.0  // should be 9.0

> 3� + 3
<console>:6: error: toDegree(3.0).� of type Double does not take parameters
       3� + 3
        ^
```

example of an empty-paren function


```scala
> implicit def toDegree( d:Double ) = new {

	def �() = d*2 // empty-paren method
}
toDegree: (d: Double)java.lang.Object{def �(): Double}

> 3�
res3: Double = 6.0 // ok

> 3�()
res4: Double = 6.0 // ok

> 3 + 3� 
res5: Double = 12.0 // should be 9.0

> 3� + 3
<console>:8: error: too many arguments for method �: ()Double
       3� + 3
        ^
> 3 + 3�()
res6: Double = 9.0  // ok

> 3�() + 3�()
res7: Double = 12.0 // ok

> 3�() + 3�
res8: Double = 18.0 // should be 12.0

```


this is as specified. the parameterless version

```scala
3 + 3�
```

is a postfix operation (according to the spec), it is parsed as
```scala
InfixExpr(3+3) id(�)
```

when you add the empty parameter list, the `�` becomes an infix operator, so in the expression
```scala
3 + 3 � ()
```
we have two infix operators, `+` and `�`. now, the operator precedence comes into play, and `+` has lower precedence.
Replying to [comment:1 rytz]:
> ...
> is a postfix operation (according to the spec), it is parsed as
> ...

for what reason have postfix operators a lower precedence?
in maths postfix operators have a higher precedence than infix operators, e.g.
factorial 2!, degree 180�, power, matrix transpose.

postfix operators with higher precedence would allow more consise internal dsl.
Replying to [comment:2 dft]:
> Replying to [comment:1 rytz]:
> > ...
> > is a postfix operation (according to the spec), it is parsed as
> > ...
> 
> for what reason have postfix operators a lower precedence?


i think it's because any parameterless method can be used in postfix, and for non-special symbols it's more intuitive. the following gives you a list from 1 to 10.
```scala
  1 to 10 toList
```
Replying to [comment:3 rytz]:
> Replying to [comment:2 dft]:
> > Replying to [comment:1 rytz]:
> {code}
>   1 to 10 toList
> }}

I see. I must be more precise. The precedence of postfix operators should be the same
as of infix operators. 

Scala reference says

The precedence of an infix operator is determined by the operator’s first character.
Characters are listed below in increasing order of precedence, ...
